xml/StopTransaction.xml

<x:Envelope xmlns:x="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="urn://Ocpp/Cs/2012/06/">
    <x:Header>
        <ns:chargeBoxIdentity>{{.ChargeBoxID}}</ns:chargeBoxIdentity>
        <wsa5:Action>/StopTransaction</wsa5:Action>
    </x:Header>
    <x:Body>
        <ns:stopTransactionRequest>
            <ns:transactionId>{{.TransactionID}}</ns:transactionId>
            <ns:idTag>{{.AuthID}}</ns:idTag>
            <ns:timestamp>{{.DateTimeStop}}</ns:timestamp>
            <ns:meterStop>0</ns:meterStop>
        </ns:stopTransactionRequest>
    </x:Body>
</x:Envelope>